<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"30d1ad4408c037222334c051fc7df14ee16d9350a6055934beee80f29bb77a54","plan_job_ref":"Job Test actions using target and replace #458 at https://github.com/dflook/terraform-github-actions/actions/runs/13593327812","plan_out_hash":"27165f946559fe4cb37597c3e67b52a51dfa45670e0b63e106226d4da7504fec","plan_hash":"1e03e9505b02f3ab1995f2478b1fddd6b9d1dd09f48690fdf53fd952c56b0ecb","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "6PZ3KyfxuD" -> (known after apply)
!~  foreach = "BQdC2inIYB" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #458](https://github.com/dflook/terraform-github-actions/actions/runs/13593327812)